crud/app/controllers/users_controller.rb

INSERT INTO "users" ("id", "name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 3], ["name", "test3"], ["email", nil], ["password", "[FILTERED]"], ["created_at", "2023-07-31 21:10:01.096504"], ["updated_at", "2023-07-31 21:10:01.096504"]]
---
  def create
    user = User.new(user_params)
    user.save()

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "guilherme test"], ["email", "guilherme@test.com test"], ["updated_at", "2023-08-02 20:32:14.794898"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    user[:name] = params[:name]
    user[:email] = params[:email]
    user.save()